{
  "auto_mapping": null,
  "base_model_name_or_path": "bert-base-uncased",
  "bias": "lora_only",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 32,
  "lora_dropout": 0.0,
  "modules_to_save": [
    "classifier"
  ],
  "peft_type": "LORA",
  "r": 16,
  "revision": null,
  "target_modules": [
    "dense"
  ],
  "task_type": "SEQ_CLS"
}